export class NaverHanjaInfo
{
    getlearning_info_category_1depthContObj()
    {
        return {
            "상형문자": "구체적인 사물의 모양을 본뜸.<br>한자는 여러 가지 과정을 거쳐서 만들어졌다. 그 중 가장 기본적인 것은 사물의 모양을 본떠서 글자를 만드는 것이다. 이러한 원리를 '상형(象形)'이라고 하고, 이렇게 만들어진 글자를 '상형자(象形字)'라고 한다.",
            "지사문자": "추상적인 뜻을 점이나 선으로 표시.<br>위치나 동작, 마음 속의 생각이나 뜻 등은 본뜰 대상이 없다. 이런 경우 일정한 선과 점으로 그러한 뜻을 표시하여 글자를 만들었다. 이러한 원리를 '지사(指事)'라고 하고, 이렇게 만들어진 글자를 '지사자(指事字)'라고 한다.",
            "회의문자": "두 글자의 뜻을 합쳐 새 글자를 만듦.<br>이미 만들어진 둘 이상의 한자를 합하여 새로운 뜻을 나타낸 원리이다. 그리고 한자의 뜻을 우리말로 새긴 것을 '훈(訓)'이라고 한다. 문화가 발달하고 사회가 복잡해지면서 한자의 뜻도 차차 복잡하게 그 뜻이 갈라져 나갔다.",
            "형성문자": "뜻 부분과 음 부분 글자의 결합.<br>이미 만들어진 글자를 모아서 새로운 글자를 만들되, 뜻을 나타내는 부분과 음을 나타내는 부분으로 구분되어 만들어진 경우이다. 이러한 원리를 '형성(形聲)'이라고 하고, 이렇게 만들어진 글자를 '형성자(形聲字)'라고 한다.",
            "전주문자": "이미 만들어진 글자를 가지고 유추하여 다른 뜻을 끌어 냄.<br>아직 정해진 학설은 없으나, 하나의 글자가 가지고 있는 원래의 뜻에서 갈라져 나온 새로운 뜻을 전주(轉注)라고 한다. 즉, 한자의 3요소 형(形)·음(音)·의(義) 중, 형태는 놓아 두고 '음(音)'과 '의(義)'만을 만들어 쓰는 글자이다.",
            "가차문자": "이미 있는 글자의 뜻에 관계 없이 음이나 형태를 빌려 씀.<br>본래 글자는 없이 소리만 존재하는 것을 소리가 같거나 비슷한 글자를 사용하여 적는다는 뜻에서 '가차(假借)'라고 한다. 현대어에서는 주로 외래어의 표기에 많이 사용된다.",
            "우리나라": "우리나라에서 만든 한자를 국자(國字)라고 부르며, 중국이나 일본에서는 통용되지 않음.<br>옛날 인명과 지명에 많이 사용된 우리나라에서 만들었거나 주로 통용되는 한자이다. ",
            "일본자": "일본에서 만들어 사용하는 한자로 한국이나 중국과는 통용되지 않음.<br>일본자의 경우, 약자의 경우와 음, 훈의 유무에 따른 조합이 있다.",
            "지사문자, 우리나라": "<b>지사문자</b>는 추상적인 뜻을 점이나 선으로 표시.<br>이러한 원리를 '지사(指事)'라고 하고, 이렇게 만들어진 글자를 '지사자(指事字)'라고 한다.<br><br>우리나라에서 만든 한자를 국자(國字)라고 부르며, 중국이나 일본에서는 통용되지 않음.<br>옛날 인명과 지명에 많이 사용된 우리나라에서 만들었거나 통용되는 한자이다. ",
            "형성문자, 우리나라": "<b>형성문자</b>는 뜻 부분과 음 부분 글자의 결합.<br>이러한 원리를 '형성(形聲)'이라고 하고, 이런 글자를 '형성자(形聲字)'라고 한다.<br><br>우리나라에서 만든 한자를 국자(國字)라고 부르며, 중국이나 일본에서는 통용되지 않음.<br>옛날 인명과 지명에 많이 사용된 우리나라에서 만들었거나 주로 통용되는 한자이다. ",
            "회의문자, 우리나라": "<b>회의문자</b>는 두 글자의 뜻을 합쳐 새 글자를 만듦.<br>이미 만들어진 둘 이상의 한자를 합하여 새로운 뜻을 나타낸 원리이다. 그리고 한자의 뜻을 우리말로 새긴 것을 '훈(訓)'이라고 한다.<br><br>우리나라에서 만든 한자를 국자(國字)라고 부르며, 중국이나 일본에서는 통용되지 않음.<br>옛날 인명과 지명에 많이 사용된 우리나라에서 만들었거나 주로 통용되는 한자이다. ",
            "형성문자, 일본자": "<b>형성문자</b>는 뜻 부분과 음 부분 글자의 결합.<br>이러한 원리를 '형성(形聲)'이라고 하고, 이런 글자를 '형성자(形聲字)'라고 한다.<br><br>일본에서 만들어 사용하는 한자로 한국이나 중국과는 통용되지 않음.<br>일본자의 경우, 약자의 경우와 음, 훈의 유무에 따른 조합이 있다.",
            "國字源(국자원)": "한국에서 만들어 써 온 고유한자의 형성원리.",
            "부수자": ""
        };
    }
}